sys/223.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">       
      <input>
            &lt;SYSMessage&gt;
            &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="223" value="Gebelik Bildirim Veri Seti"/&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
                        &lt;author&gt;
                        &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                            &lt;/author&gt;
                            &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
                        &lt;recordData&gt;
                        &lt;GEBELIK_BILDIRIM_VERI_SETI&gt;
                            &lt;BIR_ONCEKI_DOGUM_DURUMU version="1" codeSystemGuid="d7e6d65a-b82a-6717-e040-7c0a021654a2" code="<%=BIR_ONCEKI_DOGUM_DURUMU.KODU %>" value="<%=BIR_ONCEKI_DOGUM_DURUMU.ADI %>" /&gt;
                                &lt;SON_ADET_TARIHI value="<%=SON_ADET_TARIHI %>" /&gt;
                                &lt;/GEBELIK_BILDIRIM_VERI_SETI&gt;
                        &lt;HASTA_TAKIP_BILGISI&gt;
                            &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                </input>
            </SYSSendMessage>
            </s:Body>
    </s:Envelope>